# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

ch: 4
# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
   [ -1, 1, Silence, [ ] ] , # 0-P1/2
   [0, 1, ChannelToNumber, []] , # 1-P1/2
   [-1, 1, Conv, [32, 3, 1]],   # 2-p0/1
   [-1, 1, Conv, [64, 3, 2]],   # 3-P1/2
   [-1, 1, Conv, [64, 3, 1]],   # 4-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 5-P2/4

   [-1, 1, ELAN, [256]],  # 6-P2/4

   [-1, 1, MP_1, [256]],  # 7-P3/8 256-256
   [-1, 1, ELAN, [512]],  # 8-P3/8

   [-1, 1, MP_1, [512]],  # 9-P4/16 512-512
   [-1, 1, ELAN, [1024]], # 10-P4/16

   [-1, 1, MP_1, [1024]], # 11-P5/32
   [-1, 1, ELAN, [1024, True]],  # 12-P5/32 1024-1024

   [-1, 1, SPPCSPC, [512]], # 13

   [ 8, 1, NumberToChannel, [ ] ],  # 14
   [ 10, 1, NumberToChannel, [ ] ] , # 15
   [ 13, 1, NumberToChannel, [ ] ],  # 16
  ]

# yolov7 head
head:
  [
   [-1, 1, Conv, [256, 1, 1]], # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [256, 1, 1]], # 19 route backbone P4
   [[-1, -2], 1, Concat, [1]], # 20
   [-1, 1, ELAN_H, [256]], # 21 512-256

   [-1, 1, Conv, [128, 1, 1]], # 22
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 23
   [14, 1, Conv, [128, 1, 1]], # 24 route backbone P3
   [[-1, -2], 1, Concat, [1]], # 25
   [-1, 1, ELAN_H, [128]], # 26 256-128

   [-1, 1, MP_2, [256]], # 27 128-256
   [[-1, 21], 1, Concat, [1]], # 28 route backbone P4
   [-1, 1, ELAN_H, [256]], # 29 512-256

   [-1, 1, MP_2, [512]], # 30 256-512
   [[-1, 16], 1, Concat, [1]], # 31 route backbone P5
   [-1, 1, ELAN_H, [768]], # 32 1024-512
#
   [26, 1, RepConv, [256, 3, 1]],  # 33 128-256
   [29, 1, RepConv, [512, 3, 1]],  # 34 256-512
   [32, 1, RepConv, [1024, 3, 1]], # 35 512-1024
#   [[21], 1, Detect, [nc]], # Detect(P3, P4, P5)
   [[33,34,35], 1, Detect, [nc]], # Detect(P3, P4, P5)
  ]

